import { useTheme } from "styled-components";

const Home = () => {
  const theme = useTheme();
  return (
    <div style={{ padding: theme.space[5] }}>
      <p style={{ marginBottom: theme.space[5] }}>
        <strong>Технічне завдання</strong>
      </p>

      <ol>
        <li>Відповідно до макету потрібно реалізувати картки юзера.</li>
        <li>
          При клікові на кнопку Follow - текст змінюється на Following. Також
          змінюється колір кнопки. А до кількості фоловерів додається і ваш.
          Тобто, початкова кількість складає 100,500 фоловерів. При клікові на
          кнопку буде 100,501.
        </li>
        <li>
          При оновлені сторінки має фіксуватись кінцевий результат дій юзера.
          Тобто, якщо клікнути по кнопці і оновити сторінку - то кнопка все
          рівно залишається в стані Following із відповідним кольором, а
          кількість фоловерів НЕ зменшується до початкового значення.
        </li>
        <li>
          При повторному клікові на кнопку її текст та колір змінюються до
          початкового стану. Також змінюється і кількість фоловерів. Вона
          зменшується на 1 (100,500). 5. В коді цифра 100,500 має бути прописана
          одним значенням (100500). В UI - виведено через кому (100,500).
        </li>
        <li>
          В коді цифра 100,500 має бути прописана одним значенням (100500). В UI
          - виведено через кому (100,500).
        </li>
        <li>
          Створи свій персональний бекенд для розробки за допомогою UI-сервісу
          mockapi.io.
        </li>
      </ol>
    </div>
  );
};

export default Home;
